{
  "SECTIONS": {
    "PROFILE": "Profile",
    "EDU": "Education",
    "EXP": "Experiences",
    "ABILITIES": "Abilities",
    "WORK": "Works",
    "CONTACT": "Contact",
    "INTEREST": "Interests"

  },
  "FOOTER": {
    "MADEWITH": "Made With :",
    "WRITTEN": "Written by hand with multiple ideas from the web :)"
  },

  "PROFILE": {
    "LEAD": "I am a creative Full-Stack Developer",
    "ABOUT": "About me",
    "CONTENT": "After three years of part-time training, I obtained my Master Degree in Software Engineering and decided to move to Australia to improve my technical and relationnal skills. <br> <br> Back home after 3 years, I am now looking for a new adventure within a development team where I can bring and increase my knowledge.",
    "DETAILS": {
      "TITLE": "Details",
      "NAME": "Name",
      "PHONE": "Phone",
      "LOCATION": "Location"
    },
    "RESUME": "My static resume"
  },
  "EDU": {
    "EPSI": "EPSI Engineering School",
    "MASTER": {
      "TITLE": "Master Degree in Software Engineering",
      "CONTENT": "EPSI is an engineering school estalished in 9 cities in France. It propose an engineering course with the possibility to do a part-time training during 3 years in a company. I decided to follow the <b>software engineering course</b>, where i learned to <b>manage and develop projects</b> with various technologies and methodologies. I finally worked on some more generic skills like security, finances, ludification and customers relationships. At the end of my education, I writed a <a href='https://drive.google.com/drive/u/0/folders/0B8mnVHL4jn2_SDFhcGtKNFJ1ck0'>Master Thesis</a> about the digital revolution for conventional companies."
    },
    "BTS": {
      "TITLE": "Technical degree in software development",
      "CONTENT": "After obtaining my High-School Diploma, I decided to follow a generic IT formation at EPSI Bordeaux for two years, <b>preparing me to integrate an engineering school</b>. During these two years I <b>learned the basics of software developement and system network information.</b>"
    },
    "LANG": "Language Skills",
    "FRENCH": {
      "TITLE": "French",
      "CONTENT": "Mother tongue"
    },
    "ENGLISH": {
      "TITLE": "Fluent English",
      "CONTENT": " - <strong>Three years of professionnal experience</strong> in a full english speaking envirronment in Australia <br> - <strong > 7.5 / 9 </strong> at the International English Language Testing System <strong>(IELTS)</strong> <br> - <strong> 915 / 990 </strong> at the Test of English for International Comunication <strong>(TOEIC)</strong > "
    }
  },
  "EXP": {
    "1ICT": {
      "TITLE": "Full Stack Developer",
      "LEAD": "I have been part of different missions at 1ICT, one of <b>Australia’s most trusted and fastest growing</b> IT companies. During three years I took <b>a core role</b> in the development of multiple <b>Web projects</b>, inlcuding <b>creation, deployment and maintenance</b>, but also <b>scoping, quoting and project management</b>. I worked in fast paced environments that requires <b>adaptability and agility</b> to meet daily deliverables. This often requires <b>communicating with clients and other team members</b> to find solutions to complex business requirements.",
      "MISSIONS": {
        "TITLE": "Missions description",
        "DOMINOS": {
          "TITLE": "Dominos Pizza",
          "CONTENT": "I first started as a Contractor at one of the client of the company : <b>Dominos Pizza</b>. At their office, I implemented both <b>backend and frontend solutions</b> for their store management. I had to adapt and bring my development skills to the Dominos team in Brisbane. To reach my goals I used multiple technologies like <b>Windows Azure, Angular 6+, KnockoutJS, C# .NET, SQL Serveur</b>."
        },
        "CASH": {
          "TITLE": "CashFlowMapper",
          "CONTENT": "I <b>managed the migration and development </b> of a <b>financial web application</b> for a client of my company. I had to perform <b>quoting and scoping</b> and work in relationship with the client. We were using an <b>AGILE methodology</b> to drive the project, and the following technologies : <b>Javascript, DNN, C# and Microsoft Azure</b>."
        },
        "SWIM": {
          "TITLE": "Swiming Australia",
          "CONTENT": "I joined a <b>frontend developpement team</b> to work on a complex Web application. The goal was to develop features for a <b>taylor-made social network</b> for the Australian Swimmers organization, using the following technologies : <b>Angular 6+, C#, .NET, SQL Server</b>."
        },
        "BA365": {
          "TITLE": "BA365",
          "CONTENT": "Ma last mission was to <b>develop a taylor-made website and a native mobile App </b> for a security company. I suggested to use the <b>Nativescript framework</b> that help us to develop a <b>Angular Website</b> and a <b>native Android/IOS app</b> using <b>the same code</b>. I also managed the <b>iR&D hub</b> to implement a <b>beacon</b> solution tp work with the mobile app and <b>detect the movement</b> of the security company employees. This project was drived by a team of multiple developers using an <b>AGILE methodology</b> and the following technologies: <b>Angular 6+, Nativescript, C3 .NET, Estimote</b>."
        }
      }
    },
    "PERNOD": {
      "TITLE": "Solution Expert",
      "LEAD": "Pernod Ricard is the world's co-leader wines and spirits group and therefore it got multiples IT challenges. During two years of part-time training, I got involved in the implementation of software solutions within a dynamic and ambitous team.",
      "FIRST": {
        "TITLE": "First mission (2014)",
        "CONTENT": " Analyse and <b>C# .NET</b> development with the IT team of Pernod-Ricard during my part-time training. <b>Decision and implementation</b> of a technical choice to migrate the specific tools of the Enterprise Resource Planning."
      },
      "SECOND": {
        "TITLE": "Second mission (2015)",
        "CONTENT": "<b>Management and development</b> of a <b>Google Glass</b> application within the <b>innovation hub</b> of Pernod-Ricard. The goal was to propose and create useful apps for the company activity with <b>Google Glass</b>."
      }
    },
    "SOLICIS": {
      "TITLE": "JAVA/Web Developer",
      "LEAD": "Solicis is a young start-up located in Angoulême, France. It proposes taylor-made software solutions for industries or companies, and work with an advanced technology. I worked on several missions during my part-time training at Solicis, which involved multilingual and multiplatform development, teamwork and customer relationships. I used numerous technologies like <b>Java, REST applications, dynamic website with Ajax/JQuery and Zend Framework (Php)</b>. We used the <b>AGILE method Scrum</b> to manage our projects."
    },
    "MMPJ": {
      "TITLE": "Web Developer",
      "LEAD": "This was my first professional experience in software development, I was part of the IT team of Martell-Mumm-PerrierJouët, a Pernod-Ricard affiliate. I worked on the integration and development of an archive management application for the company, using <b>ASP.NET/Javascript</b> development with an <b>Oracle database"
    }
  },
  "ABILITIES": {
    "DEV": "Development",
    "MISC": "Misc",
    "DATA": "Database",
    "METO": {
      "TITLE": "Methodology",
      "AGILE": "Agile software development",
      "CI": "Continuous integration",
      "TEST": "Testing (frontend, backend, unit, end to end)",
      "UX": "User Experience"   
    },"OTHERS": {
        "TITLE": "Other Skills",
        "TM": "Team Work",
        "DESIRE": "Desire to Learn & Improve"
      }
  },
  "WORKS":{
    "LEAD": "Below is a selection of recents projects I worked on",
    "ALL": "All",
    "READMORE": "Read More",
    "VIEW": "View App",
    "GITHUB": "View Code",
    "PROJECTS":{
      "SM":{
        "LEAD": "The simplest and smartest metronome on the Web. <br>Installable as an app on your phone",
        "CONTENT": "Smart Metronome is a progressive web app written with React. The purpose of this app is to provide a reliable, simple metronome for your music training sessions. The challenge was to create a timing precision using javascript running in a browser, to do that I implemented Web Workers to perform multi-threading and the javascript Web Audio API for precise timing."
      },
      "BLOG":{
        "LEAD": "Creation of a blog on the Web using the MEAN Stack (Mongo, Express, Angular, Node)",
        "CONTENT": "Mean Stack Blog is a responsive online blog I created for my website. I used the MEAN stack which is a group of cutting edge tools used to develop a fully reliable, securised, maintainable, elegant Web application. Only one programming language is used for the whole application : Javascript, a considerable advnatage ensuring consistency and understanding of the code."
      },
      "TEMTEM":{
        "LEAD": "A Web application for Temtem strategies, in progress ",
        "CONTENT": "After I played the game Temtem, I decided to develop a website to help players preparing strategies for the game. Also, it was the occasion for me to increase my skills with React and Redux. Still in progress, I use a React Redux frontend and a Severless Firebase infrastructure  for the backend with a firestore database."
      },
      "CHIRO":{
        "LEAD": "Dynamic website for contacting, reserving and introducing a Chiropractor",
        "CONTENT": "This dynamic website is written with the following technologies : Angular et Firebase. I am using a serverless architecture with Firebase cloud functions to process my reservetion and contact tasks. The challenge here was to synchronise the web calendar with the client's one already existing. To implement this I used Google APIs in my cloud functions to update the calednars when needed."
      },
      "SPACE":{
        "LEAD": "Fun Online 3D Space Invaders game with Javascript libraries, give it a try !",
        "CONTENT": "This game was built with the javascript 3D framework three.js, allowing us to create some polygon mesh and interact with them. This game is the result of a school project with time and technical constraint. You can play the game, check the code or watch a fun trailer about the game."
      },
      "GGLASS":{
        "LEAD": "An augmented reality project with Pernod-Ricard and the Goggle Glass, a real challenge with one of the most cutting edge tool",
        "CONTENT": "The goal was to create useful apps for the company's industry, I built two apps that can work in the warehouses and the vineyards to display information while having free hands. To develop with this device I used Java with the Android SDK that contains all the sources needed to work with the glasses. I also created a tutorial to help people to built app with Google Glass."
      },
      "GARO":{
        "LEAD": "A tweet war game website played during the french rock festival Garorock",
        "CONTENT": "This webapp was deployed during the french rock festival Garorock. The french bank Crédit Agricole asked for a tweet war game to entertain their guest at the festival. This webapp is developed with PHP and Javascript Ajax/Jquery, using the twitter API to retrieve guest's twweets"
      },
      "BA365":{
        "LEAD": "A website and native IOS/Android apps for complex and futuristic challenges",
        "CONTENT": "This project was very challenging from a technical point of view, I had to implement a website and two native apps taht works with each others real-time to process a lot of data and Estimote movements and interactions triggers. I sugested Nativescript to create all of those apps with an unique code base allowing us to ensure coherance, security for all the platforms."
      }
    }
  },
  "INTEREST": {

  },
  "CONTACT": {
    "TITLE": "Your contact details ",
    "FORM":{
      "NAME": "Name",
      "ENTREPRISE": "Company",
      "PHONE": "Phone",
      "MSG": "Message content",
      "PH": "Write your message",
      "SEND": "Send",
      "SENDING": "Send",
      "REQ": "required",
      "INV": "invalid"
    },
    "SUCCESS": "Successfully sent",
    "ERROR": "Error from the server"
  }
}
