{
  "SECTIONS": {
    "PROFILE": "Profil",
    "EDU": "Etudes",
    "EXP": "Experiences",
    "ABILITIES": "Compétences",
    "WORK": "Projets",
    "CONTACT": "Contact"

  },
  "FOOTER": {
    "MADEWITH": "Propulsé avec :",
    "WRITTEN": "Codé à la main avec plein d'idées du web :)"
  },

  "PROFILE": {
    "LEAD": "Je suis un developpeur full-stack créatif",
    "ABOUT": "À propos",
    "CONTENT": "Aprés trois ans d'experience en alternance et mon diplôme d'ingénieur en poche, j'ai décidé de partir à l'étranger pour perfectionner mes connaissances techniques et relationnelles en Australie. <br> <br> De retour en France après trois ans, je suis à la recherche d'une nouvelle aventure au sein d'une équipe de développpement pour apporter mes connaissances et les enrichir. ",
    "DETAILS": {
      "TITLE": "Détails",
      "NAME": "Nom",
      "PHONE": "Télephone",
      "LOCATION": "Localisation"
    },
    "RESUME": "CV classique"
  },
  "EDU": {
    "EPSI": "Ecole d'ingénierie EPSI",
    "MASTER": {
      "TITLE": "Diplôme d'Ingénieur en solutions logicielles",
      "CONTENT": "L'EPSI est une école d'ingenieur informatique basée dans 10 villes en France qui propose un cycle d'<b>ingéniérie informatique en alternance</b> pendant 3 ans. J'ai décidé de suivre <b>le cycle d'ingénieur logiciel </b> où j'ai pu apprendre à <b>développer et gérer des projets informatiques </b> en utilisant de multiples techonologies et méthodologies. D'autres sujets tel que la <b>sécurité, la relation client et la gamification</b> m'ont été enseigné durant ma formation. A la fin de celle-ci, j'ai écris <a href='https://drive.google.com/drive/u/0/folders/0B8mnVHL4jn2_SDFhcGtKNFJ1ck0'>un mémoire</a> sur le virage digital des entreprises classiques en collaboration avec Pernod-Ricard, mon entreprise d'alternance."
    },
    "BTS": {
      "TITLE": "BTS de dévelopement informatique",
      "CONTENT": "Aprés l'obtention de mon bac, j'ai décidé de suivre une formation générique en informatique à L'EPSI Bordeaux pour me <b>préparer à l'intégration d'une école d'ingénieur</b>. Pendant deux ans, j'ai acquéris de <b>solides bases en développement et réseau système</b>."
    },
    "LANG": "Langues",
    "FRENCH": {
      "TITLE": "Français",
      "CONTENT": "langue maternelle"
    },
    "ENGLISH": {
      "TITLE": "Anglais courant",
      "CONTENT": " - <strong>Trois ans d'expérience professionnelle</strong> dans un environement anglophone en Australie<br> - <strong>7.5 / 9</strong> à l' International English Language Testing System <strong>(IELTS)</strong><br> - <strong>915/990</strong> au Test of English for International Comunication <strong>(TOEIC)</strong>"
    }
  },
  "EXP": {
    "1ICT": {
      "TITLE": "Développeur Full Stack",
      "LEAD": "J'ai participé a plusieurs missions chez 1ICT, une des entreprise de services informatiques possédant <b>la plus forte croissance en Australie</b>. Pendant trois j'ai tenu un rôle important dans la réalisation de plusieurs <b>projets Webs</b>, inlcuant le <b>développment</b>, <b>le déploiment et le maintiens</b> de solutions Web, ainsi que <b>le chiffrage et la gestion de projets client</b>.  J'ai travaillé dans différents environements, requierant une forte <b>adaptabilité et agilité</b> pour accomplir les objéctifs. Cela implique une <b>communications clair et constante<b/> entre l'équipe et le client pour mettre en place des solutions à de complexes besoins métiers.",
      "MISSIONS": {
        "TITLE": "Descriptif des missions",
        "DOMINOS": {
          "TITLE": "Dominos Pizza",
          "CONTENT": "J'ai dabord était envoyé en tant que consultant chez un client de l'entreprise : <b>Dominos Pizza</b>. Là-bas j'ai <b>mis en place des solutions logicielles de type back-office et frontend</b> pour la gestion de leur magasins. J'ai dû m'adapter à l'équipe de développement de Dominos qui est à la pointe de la technologie dans la région de Brisbane. J'ai utilisé des technologies telles que <b>Windows Azure, Angular 2+, KnockoutJS, C#, SQL Serveur</b>."
        },
        "CASH": {
          "TITLE": "CashFlowMapper",
          "CONTENT": "<b>Gestion de la migration et du développement</b> d'une apllication web de <b>flux financiers</b> pour un client de l'entreprise. Un de mes objéctifs était de <b>réaliser des chiffrages</b> ainsi que de <b>gérer les besoins</b> du client. Nous utilisions une <b>méthodologie AGILE</b> tout au long du développement du projet, ainsi que les technologies suivantes : <b>Javascript et DNN, C# et Microsoft Azure</b>."
        },
        "SWIM": {
          "TITLE": "Swiming Australia",
          "CONTENT": "J'ai ensuite rejoins une <b>équipe de développement frontend</b> pour travailler sur une application Web complexe. Les objéctifs étaient de <b>développer et maintenir un  résau social sur-mesure </b>pour l'association des nageurs australiens, en utilisant les technologies suivantes : <b>Angular 6, C# .NET, SQL Server</b>."
        },
        "BA365": {
          "TITLE": "BA365",
          "CONTENT": "Ma dernière mission fut de <b>développer un site web et une application mobile sur-mesure</b> pour une entreprise de sécurité. J'ai proposé de répondre à la problématique en utilisant le <b>framework Nativescript</b> qui permet de développer un <b>site Web Angular</b> et une <b>application native Android et IOS</b> à partir du <b>même code</b>. J'ai aussi pris en charge le <b>pôle R&D</b> du projet qui consistait à mettre en place des <b>beacons (capteurs)</b> en relation avec l'application mobile pour <b>détecter les mouvement</b> du personnel de l'entreprise cliente. Ce développement c'est déroulé au sein d'une équipe de plusieurs développeurs en utilisant une <b>méthodologie AGILE</b> et les technologies suivantes: <b>Angular 6+, Nativescript, C3 .NET, Estimote</b>."
        }
      }
    },
    "PERNOD": {
      "TITLE": "Solution Expert",
      "LEAD": "Pernod-Ricard est le co-leader mondial des vins et spiritueux et par conséquant il possède de nombreuses problématiques logicielles. Pendant 2 ans en alternance, j'ai participé à la réalistion de solutions logicielles au sein d'une équipe dynamique et ambitieuse.",
      "FIRST": {
        "TITLE": "Première mission (2014)",
        "CONTENT": "Analyse et développement <b>C# .Net</b> au sein du service informatique de MMPJ. <b>Décision et mise en place</b> du choix technique pour la migration des outils spécifiques du progiciel de gestion intégré de l’entreprise."
      },
      "SECOND": {
        "TITLE": "Deuxieme mission (2015)",
        "CONTENT": "<b>Direction et développement</b> d'applications <b>Google Glass</b> au sein du <b>pôle innovation</b> de Pernod-Ricard. Le but était de proposer et de créer des applications pertinentes pour l'activité de l'entreprise sur un support à la pointe de la technologie : les <b>Google Glass</b> (voir section projets)."
      }
    },
    "SOLICIS": {
      "TITLE": "Développeur JAVA/Web",
      "LEAD": "Solicis est une jeune entreprise de services informatique basée à Angôuleme. Elle propose des solutions innovantes et de pointes pour répondre aux besoins de multiples entreprises et industries. J'ai pris part à plusieurs projets lors de mon alternance chez Solicis, impliquant du developpement multilangues et multi plate-formes, du travail d'équipe et des relations clients. J'ai pu apporter et enrichir mes connaissances de diverses technologies tel que <b>Java, arcitecture REST,  Ajax/JQuery and Zend Framework (Php)</b>. Toute l'équipe de developpement travaillé en suivant les directives de la <b>méthode agile nommé Scrum</b>."
    },
    "MMPJ": {
      "TITLE": "Développeur Web",
      "LEAD": "Mon premier stage en developpement informatique au sein de la société Martell-Mumm-Perrier-Jouët à Cognac. Intégration et développement d’une application de gestion des archives des sociétés Martell, Mumm, Perrier-Jouët utilisant les <b>tecnhologies Microsoft ASP .NET</b> et mise en place d’une <b>base de données Oracle</b>"
    }
  },
  "ABILITIES": {
    "DEV": "Développement",
    "MISC": "Divers",
    "DATA": "Base de donnnées",
    "METO": {
      "TITLE": "Méthodologie",
      "AGILE": "Méthodes AGILE",
      "CI": "Intégration continue",
      "TEST": "Tests (frontend, backend, unit, end to end)",
      "UX": "Expérience utilisateur (UX)"

    },
    "OTHERS": {
      "TITLE": "Autre",
      "TM": "Travail d'équipe",
      "DESIRE": "Soif d'apprendre"
    }
  },
  "WORKS":{
    "LEAD": "Voici une sélection des projets que j'ai réalisés",
    "ALL": "Tous",
    "READMORE": "Plus d'info",
    "VIEW": "Voir l'App",
    "GITHUB": "Voir code"
  },
  "CONTACT": {
    "TITLE": "Vos coordonnées",
    "FORM":{
      "NAME": "Nom",
      "ENTREPRISE": "Entreprise",
      "PHONE": "Télephone",
      "MSG": "Message",
      "PH": "Ecrivez votre message",
      "SEND": "Envoyer",
      "SENDING": "Envoi",
      "REQ": "requis",
      "INV": "invalide"
    },
    "SUCCESS": "Envoyé avec succés",
    "ERROR": "Erreur du serveur"
  }
}
